# [SQL Assignment](#0)

In [ ]:
'https://drive.google.com/file/d/1JGsnccuRtcXXxouEFrKYDSa7qDB724TU/view'   # google drive link for assignment

# Read the following data set

In [ ]:
'https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data'

# Rename the columns as per the columns of the link below

In [ ]:
'https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.names'

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from IPython.display import display
import sqlite3
import requests
import json

# <a id='7'>Import the data<a/>

In [2]:
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')
df.head()

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

# <a id='7'>Rename the columns<a/>

In [3]:
df.columns = ["age","workclass","fnlwgt","education","education_num","marital_status","occupation","relationship","race","sex","capital_gain","capital_loss","hours_per_week","native_country","income"]
df.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

# <a id='7'>Create a SQL Database from adult dataset and name it as SQLADB<a/>

In [4]:
import sqlalchemy
from sqlalchemy import create_engine

engine = create_engine('sqlite:///sqladb', echo=True)
df.to_sql('sqladb', engine, if_exists='replace')

2020-04-23 19:19:22,841 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2020-04-23 19:19:22,842 INFO sqlalchemy.engine.base.Engine ()
2020-04-23 19:19:22,845 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2020-04-23 19:19:22,846 INFO sqlalchemy.engine.base.Engine ()
2020-04-23 19:19:22,848 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("sqladb")
2020-04-23 19:19:22,850 INFO sqlalchemy.engine.base.Engine ()
2020-04-23 19:19:22,852 INFO sqlalchemy.engine.base.Engine PRAGMA temp.table_info("sqladb")
2020-04-23 19:19:22,859 INFO sqlalchemy.engine.base.Engine ()
2020-04-23 19:19:22,873 INFO sqlalchemy.engine.base.Engine
CREATE TABLE sqladb (
	"index" BIGINT,
	age BIGINT,
	workclass TEXT,
	fnlwgt BIGINT,
	education TEXT,
	education_num BIGINT,
	marital_status TEXT,
	occupation TEXT,
	relationship TEXT,
	race TEXT,
	sex TEXT,
	capital_gain BIGINT,
	capital_loss BIGINT,
	hours_per_week BIGINT,
	native_country TEXT,
	income TEXT
)


2020-04-23 19:19:22,878 INFO sqlalchemy.engine.base.Engine ()
2020-04-23 19:19:22,889 INFO sqlalchemy.engine.base.Engine COMMIT
2020-04-23 19:19:22,898 INFO sqlalchemy.engine.base.Engine CREATE INDEX ix_sqladb_index ON sqladb ("index")
2020-04-23 19:19:22,899 INFO sqlalchemy.engine.base.Engine ()
2020-04-23 19:19:22,904 INFO sqlalchemy.engine.base.Engine COMMIT
2020-04-23 19:19:22,942 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-04-23 19:19:23,426 INFO sqlalchemy.engine.base.Engine INSERT INTO sqladb ("index", age, workclass, fnlwgt, education, education_num, marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2020-04-23 19:19:23,427 INFO sqlalchemy.engine.base.Engine ((0, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K'), (1, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (2, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (3, 28, ' Private', 338409, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', 0, 0, 40, ' Cuba', ' <=50K'), (4, 37, ' Private', 284582, ' Masters', 14, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (5, 49, ' Private', 160187, ' 9th', 5, ' Married-spouse-absent', ' Other-service', ' Not-in-family', ' Black', ' Female', 0, 0, 16, ' Jamaica', ' <=50K'), (6, 52, ' Self-emp-not-inc', 209642, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 45, ' United-States', ' >50K'), (7, 31, ' Private', 45781, ' Masters', 14, ' Never-married', ' Prof-specialty', ' Not-in-family', ' White', ' Female', 14084, 0, 50, ' United-States', ' >50K')  ... displaying 10 of 32560 total bound parameter sets ...  (32558, 22, ' Private', 201490, ' HS-grad', 9, ' Never-married', ' Adm-clerical', ' Own-child', ' White', ' Male', 0, 0, 20, ' United-States', ' <=50K'), (32559, 52, ' Self-emp-inc', 287927, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 15024, 0, 40, ' United-States', ' >50K'))
2020-04-23 19:19:23,672 INFO sqlalchemy.engine.base.Engine COMMIT

# <a id='7'>Select 10 records from the adult sqlab<a/>

In [11]:
con = sqlite3.connect("sqladb" , detect_types=sqlite3.PARSE_COLNAMES)
cur = con.cursor()

In [13]:
cur.execute("""SELECT name
               FROM sqlite_master
               WHERE type = 'table'
               ORDER BY name
;""").fetchall()

[('sqladb',)]

In [18]:
cur.execute("""SELECT * FROM sqladb LIMIT 10;""")
df0 = pd.DataFrame(cur.fetchall())
df0.columns = [x[0] for x in cur.description]
df0.head(10)

,index,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
5,5,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K
6,6,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K
7,7,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
8,8,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K
9,9,37,Private,280464,Some-college,10,Married-civ-spouse,Exec-managerial,Husband,Black,Male,0,0,80,United-States,>50K

# <a id='7'>Show me the average hours per week of all men who are not working in the private sector<a/>

In [43]:
df0.workclass.unique() # Note there is whitespace in this column so not cleaning it will defo throw errors

array([' Self-emp-not-inc', ' Private'], dtype=object)

In [81]:
cur.execute("Select avg(hours_per_week) From sqladb Where workclass = ' Private'")
df1 = pd.DataFrame(cur.fetchall())
df1.columns = [x[0] for x in cur.description]
df1.head().round(2)  # here i round it to 2 decimal places since the number was too long

   avg(hours_per_week)
0                40.27

# <a id='7'>Show the frequency table for education , occupation and relationship separately<a/>

### [Education](#0)

In [58]:
cur.execute("""SELECT education, COUNT(*) As Total from sqladb Group by education ;""")
output1 = pd.DataFrame(cur.fetchall())
output1.columns = [x[0] for x in cur.description]
output1.head()

  education  Total
0      10th    933
1      11th   1175
2      12th    433
3   1st-4th    168
4   5th-6th    333

### [Occupation](#0)

In [59]:
cur.execute("""Select occupation , count(*) As Total from sqladb Group by occupation ;""")
output2 = pd.DataFrame(cur.fetchall())
output2.columns = [x[0] for x in cur.description]
output2.head()

         occupation  Total
0                 ?   1843
1      Adm-clerical   3769
2      Armed-Forces      9
3      Craft-repair   4099
4   Exec-managerial   4066

### [Relationship](#0)

In [61]:
cur.execute("""Select relationship , Count(*) As Total from sqladb Group by relationship""")
output3 = pd.DataFrame(cur.fetchall())
output3.columns = [x[0] for x in cur.description]
output3.head()

      relationship  Total
0          Husband  13193
1    Not-in-family   8304
2   Other-relative    981
3        Own-child   5068
4        Unmarried   3446

# <a id='7'>Are there any people who are married , working in private sector and having a masters degree<a/>

In [63]:
df0.marital_status.unique()

array([' Married-civ-spouse', ' Divorced', ' Married-spouse-absent',
       ' Never-married'], dtype=object)

In [64]:
df0.workclass.unique()

array([' Self-emp-not-inc', ' Private'], dtype=object)

In [65]:
df0.education.unique()

array([' Bachelors', ' HS-grad', ' 11th', ' Masters', ' 9th',
       ' Some-college'], dtype=object)

In [70]:
cur.execute("""Select * from sqladb where marital_status = ' Married-civ-spouse' AND workclass = ' Private' AND 
               education = ' Masters' ;""")
output4 = pd.DataFrame(cur.fetchall())
output4.columns = [x[0] for x in cur.description]
output4.head()

,index,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
1,86,33,Private,202051,Masters,14,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,50,United-States,<=50K
2,99,76,Private,124191,Masters,14,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,40,United-States,>50K
3,187,31,Private,99928,Masters,14,Married-civ-spouse,Prof-specialty,Wife,White,Female,0,0,50,United-States,<=50K
4,197,35,Private,138992,Masters,14,Married-civ-spouse,Prof-specialty,Other-relative,White,Male,7298,0,40,United-States,>50K

In [ ]:
# Total Number of people who fall in the above category

In [96]:
cur.execute("""Select count(*) As Total_group from sqladb where marital_status = ' Married-civ-spouse' AND workclass = ' Private' AND 
               education = ' Masters' ;""")
output4a = pd.DataFrame(cur.fetchall())
output4a.columns = [x[0] for x in cur.description]
output4a.head()

   Total_group
0          531

# <a id='7'>What is the average, minimum and maximum age group for people working in different sectors<a/>

### [Minimum Age group in Occupation column](#0)

In [74]:
cur.execute("""Select occupation, min(age) As Minimum_age from sqladb group by occupation ;""")
output5 = pd.DataFrame(cur.fetchall())
output5.columns = [x[0] for x in cur.description]
output5.head()

         occupation  Minimum_age
0                 ?           17
1      Adm-clerical           17
2      Armed-Forces           23
3      Craft-repair           17
4   Exec-managerial           17

### [Maximum Age in Occupation columns](#0)

In [75]:
cur.execute("""Select occupation , max(age) As Max_age From sqladb group by occupation""")
output5a = pd.DataFrame(cur.fetchall())
output5a.columns = [x[0] for x in cur.description]
output5a.head()

         occupation  Max_age
0                 ?       90
1      Adm-clerical       90
2      Armed-Forces       46
3      Craft-repair       90
4   Exec-managerial       90

### [Average Age group in Occupation column](#0)

In [82]:
cur.execute("""Select occupation , avg(age) As Average_age From sqladb group by occupation""")
output5b = pd.DataFrame(cur.fetchall())
output5b.columns = [x[0] for x in cur.description]
output5b.head().round(2)

         occupation  Average_age
0                 ?        40.88
1      Adm-clerical        36.96
2      Armed-Forces        30.22
3      Craft-repair        39.03
4   Exec-managerial        42.17

# [Final Output for Ages of Occupation](#0)

In [100]:
cur.execute("""Select occupation ,min(age)As Minimum_Age, max(age)As Maximum_Age, avg(age)As Average_age 
               From sqladb group by occupation ;""")
output5c = pd.DataFrame(cur.fetchall())
output5c.columns = [x[0] for x in cur.description]
output5c.head().round(2)

         occupation  Minimum_Age  Maximum_Age  Average_age
0                 ?           17           90        40.88
1      Adm-clerical           17           90        36.96
2      Armed-Forces           23           46        30.22
3      Craft-repair           17           90        39.03
4   Exec-managerial           17           90        42.17

# WorkClass

### [Minimum Age group in Workclass column](#0)

In [84]:
cur.execute("""Select workclass , min(age) As Minimum_age From sqladb group by workclass""")
output6 = pd.DataFrame(cur.fetchall())
output6.columns = [x[0] for x in cur.description]
output6.head()

       workclass  Minimum_age
0              ?           17
1    Federal-gov           17
2      Local-gov           17
3   Never-worked           17
4        Private           17

### [Maximum Age group in Workclass column](#0)

In [77]:
cur.execute("""Select Workclass , max(age) As Max_age From sqladb group by workclass ;""")
output6 = pd.DataFrame(cur.fetchall())
output6.columns = [x[0] for x in cur.description]
output6.head()

       workclass  Max_age
0              ?       90
1    Federal-gov       90
2      Local-gov       90
3   Never-worked       30
4        Private       90

### [Average Age group in workclass column](#0)

In [86]:
cur.execute("""Select Workclass , avg(age) As Average_age From sqladb group by workclass ;""")
output7 = pd.DataFrame(cur.fetchall())
output7.columns = [x[0] for x in cur.description]
output7.head().round(2)

       workclass  Average_age
0              ?        40.96
1    Federal-gov        42.59
2      Local-gov        41.75
3   Never-worked        20.57
4        Private        36.80

# Final Output for Workclass Ages

In [99]:
cur.execute("""Select Workclass ,min(age)As Minimum_Age, max(age)As Maximum_Age, avg(age)As Average_age 
               From sqladb group by workclass ;""")
output7a = pd.DataFrame(cur.fetchall())
output7a.columns = [x[0] for x in cur.description]
output7a.head().round(2)

       workclass  Minimum_Age  Maximum_Age  Average_age
0              ?           17           90        40.96
1    Federal-gov           17           90        42.59
2      Local-gov           17           90        41.75
3   Never-worked           17           30        20.57
4        Private           17           90        36.80

# <a id='7'>Calculate the age distribution by country<a/>

### [Minimum Age group in Native_country column](#0)

In [87]:
cur.execute("""Select native_country , min(age) As Minimum_age From sqladb group by native_country ;""")
output8 = pd.DataFrame(cur.fetchall())
output8.columns = [x[0] for x in cur.description]
output8.head().round(2)

  native_country  Minimum_age
0              ?           17
1       Cambodia           18
2         Canada           17
3          China           22
4       Columbia           18

### [Maximum Age group in Native_country column](#0)

In [88]:
cur.execute("""Select native_country , max(age) As Maximum_age From sqladb group by native_country ;""")
output8a = pd.DataFrame(cur.fetchall())
output8a.columns = [x[0] for x in cur.description]
output8a.head().round(2)

  native_country  Maximum_age
0              ?           90
1       Cambodia           65
2         Canada           80
3          China           75
4       Columbia           75

### [Average Age group in Native_country column](#0)

In [89]:
cur.execute("""Select native_country , avg(age) As Average_age From sqladb group by native_country ;""")
output9 = pd.DataFrame(cur.fetchall())
output9.columns = [x[0] for x in cur.description]
output9.head().round(2)

  native_country  Average_age
0              ?        38.73
1       Cambodia        37.79
2         Canada        42.55
3          China        42.53
4       Columbia        39.71

# Final Output for Age Distribution by Country

In [101]:
cur.execute("""Select native_country ,min(age)As Minimum_Age, max(age)As Maximum_Age, avg(age)As Average_age 
               From sqladb group by native_country ;""")
output10 = pd.DataFrame(cur.fetchall())
output10.columns = [x[0] for x in cur.description]
output10.head().round(2)

  native_country  Minimum_Age  Maximum_Age  Average_age
0              ?           17           90        38.73
1       Cambodia           18           65        37.79
2         Canada           17           80        42.55
3          China           22           75        42.53
4       Columbia           18           75        39.71

# <a id='7'>Compute a new column as Net-Capital_Gain from the two columns 'capital-gain' and 'capital-loss'<a/>

In [107]:
#creating the new columns
cur.execute("""Update sqladb SET capital_gain = capital_gain - capital_loss""")

In [111]:
# Check results
cur.execute("""Select * from sqladb ;""")
"""lets put the above in my dataframe"""
df_new = pd.DataFrame(cur.fetchall())
df_new.columns = [x[0] for x in cur.description]
df_new.head()

,index,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [124]:
df_new['capital_gain'].value_counts()

 0        28330
 15024      347
 7688       284
 7298       246
-5706       202
          ...
 4931         1
 22040        1
-4617         1
 7978         1
-465          1
Name: capital_gain, Length: 210, dtype: int64

In [116]:
df_new['capital_loss'].value_counts()

0       31041
1902      202
1977      168
1887      159
1848       51
        ...
1411        1
1539        1
2472        1
1944        1
2201        1
Name: capital_loss, Length: 92, dtype: int64

In [117]:
# cur.execute("""Select (capital_gain - capital_loss)As NetCapitalGain from sqladb ;""")
# """lets put the above in my dataframe"""
# df_new1 = pd.DataFrame(cur.fetchall())
# df_new1.columns = [x[0] for x in cur.description]

   NetCapitalGain
0               0
1               0
2               0
3               0
4               0

# Taking a skeletal look at whats going on under the hood

In [122]:
print(pd.read_sql_query("SELECT * FROM sqladb", con).head(10))

   index  age          workclass  fnlwgt      education  education_num  \
0      0   50   Self-emp-not-inc   83311      Bachelors             13
1      1   38            Private  215646        HS-grad              9
2      2   53            Private  234721           11th              7
3      3   28            Private  338409      Bachelors             13
4      4   37            Private  284582        Masters             14
5      5   49            Private  160187            9th              5
6      6   52   Self-emp-not-inc  209642        HS-grad              9
7      7   31            Private   45781        Masters             14
8      8   42            Private  159449      Bachelors             13
9      9   37            Private  280464   Some-college             10

           marital_status          occupation    relationship    race  \
0      Married-civ-spouse     Exec-managerial         Husband   White
1                Divorced   Handlers-cleaners   Not-in-family   White
2      Married-civ-spouse   Handlers-cleaners         Husband   Black
3      Married-civ-spouse      Prof-specialty            Wife   Black
4      Married-civ-spouse     Exec-managerial            Wife   White
5   Married-spouse-absent       Other-service   Not-in-family   Black
6      Married-civ-spouse     Exec-managerial         Husband   White
7           Never-married      Prof-specialty   Not-in-family   White
8      Married-civ-spouse     Exec-managerial         Husband   White
9      Married-civ-spouse     Exec-managerial         Husband   Black

       sex  capital_gain  capital_loss  hours_per_week  native_country  income
0     Male             0             0              13   United-States   <=50K
1     Male             0             0              40   United-States   <=50K
2     Male             0             0              40   United-States   <=50K
3   Female             0             0              40            Cuba   <=50K
4   Female             0             0              40   United-States   <=50K
5   Female             0             0              16         Jamaica   <=50K
6     Male             0             0              45   United-States    >50K
7   Female         14084             0              50   United-States    >50K
8     Male          5178             0              40   United-States    >50K
9     Male             0             0              80   United-States    >50K

# Task2

In [ ]:
Read the following dataset

In [ ]:
2.Problem Statement Read the following data set:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data

In [130]:
data = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')
data.head()

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [ ]:
# Rename the columns

In [131]:
data.columns = ["age","workclass","fnlwgt","education","education_num","marital_status","occupation","relationship","race","sex","capital_gain","capital_loss","hours_per_week","native_country","income"]
data.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [143]:
data.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education_num',
       'marital_status', 'occupation', 'relationship', 'race', 'sex',
       'capital_gain', 'capital_loss', 'hours_per_week', 'native_country',
       'income'],
      dtype='object')

# <a id='7'>Create an sqlalchemy engine using a sample from the dataset<a/>

In [137]:
import sqlalchemy
from sqlalchemy import create_engine

engine = create_engine('sqlite:///sqladb2', echo=True)
data.to_sql('sqladb2', engine, if_exists='replace')

con  = sqlite3.connect("sqladb2")
cur = con.cursor()

2020-04-26 00:22:38,894 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1

INFO:sqlalchemy.engine.base.Engine:SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1

2020-04-26 00:22:38,897 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:38,900 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1

INFO:sqlalchemy.engine.base.Engine:SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1

2020-04-26 00:22:38,902 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:38,904 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("sqladb2")

INFO:sqlalchemy.engine.base.Engine:PRAGMA main.table_info("sqladb2")

2020-04-26 00:22:38,907 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:38,914 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("sqladb2")

INFO:sqlalchemy.engine.base.Engine:PRAGMA main.table_info("sqladb2")

2020-04-26 00:22:38,916 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:38,919 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name

INFO:sqlalchemy.engine.base.Engine:SELECT name FROM sqlite_master WHERE type='table' ORDER BY name

2020-04-26 00:22:38,921 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:38,928 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("sqladb2")

INFO:sqlalchemy.engine.base.Engine:PRAGMA main.table_info("sqladb2")

2020-04-26 00:22:38,929 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:38,936 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'sqladb2' AND type = 'table'

INFO:sqlalchemy.engine.base.Engine:SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'sqladb2' AND type = 'table'

2020-04-26 00:22:38,938 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:38,944 INFO sqlalchemy.engine.base.Engine PRAGMA main.foreign_key_list("sqladb2")

INFO:sqlalchemy.engine.base.Engine:PRAGMA main.foreign_key_list("sqladb2")

2020-04-26 00:22:38,946 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:38,949 INFO sqlalchemy.engine.base.Engine PRAGMA temp.foreign_key_list("sqladb2")

INFO:sqlalchemy.engine.base.Engine:PRAGMA temp.foreign_key_list("sqladb2")

2020-04-26 00:22:38,951 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:38,970 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'sqladb2' AND type = 'table'

INFO:sqlalchemy.engine.base.Engine:SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'sqladb2' AND type = 'table'

2020-04-26 00:22:38,986 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:38,993 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_list("sqladb2")

INFO:sqlalchemy.engine.base.Engine:PRAGMA main.index_list("sqladb2")

2020-04-26 00:22:38,997 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:39,000 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_info("ix_sqladb2_index")

INFO:sqlalchemy.engine.base.Engine:PRAGMA main.index_info("ix_sqladb2_index")

2020-04-26 00:22:39,001 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:39,004 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_list("sqladb2")

INFO:sqlalchemy.engine.base.Engine:PRAGMA main.index_list("sqladb2")

2020-04-26 00:22:39,005 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:39,008 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_info("ix_sqladb2_index")

INFO:sqlalchemy.engine.base.Engine:PRAGMA main.index_info("ix_sqladb2_index")

2020-04-26 00:22:39,010 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:39,012 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'sqladb2' AND type = 'table'

INFO:sqlalchemy.engine.base.Engine:SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'sqladb2' AND type = 'table'

2020-04-26 00:22:39,014 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:39,020 INFO sqlalchemy.engine.base.Engine
DROP TABLE sqladb2

INFO:sqlalchemy.engine.base.Engine:
DROP TABLE sqladb2

2020-04-26 00:22:39,022 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:39,094 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

2020-04-26 00:22:39,098 INFO sqlalchemy.engine.base.Engine
CREATE TABLE sqladb2 (
	"index" BIGINT,
	age BIGINT,
	workclass TEXT,
	fnlwgt BIGINT,
	education TEXT,
	education_num BIGINT,
	marital_status TEXT,
	occupation TEXT,
	relationship TEXT,
	race TEXT,
	sex TEXT,
	capital_gain BIGINT,
	capital_loss BIGINT,
	hours_per_week BIGINT,
	native_country TEXT,
	income TEXT
)

INFO:sqlalchemy.engine.base.Engine:
CREATE TABLE sqladb2 (
	"index" BIGINT,
	age BIGINT,
	workclass TEXT,
	fnlwgt BIGINT,
	education TEXT,
	education_num BIGINT,
	marital_status TEXT,
	occupation TEXT,
	relationship TEXT,
	race TEXT,
	sex TEXT,
	capital_gain BIGINT,
	capital_loss BIGINT,
	hours_per_week BIGINT,
	native_country TEXT,
	income TEXT
)

2020-04-26 00:22:39,104 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:39,110 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

2020-04-26 00:22:39,114 INFO sqlalchemy.engine.base.Engine CREATE INDEX ix_sqladb2_index ON sqladb2 ("index")

INFO:sqlalchemy.engine.base.Engine:CREATE INDEX ix_sqladb2_index ON sqladb2 ("index")

2020-04-26 00:22:39,116 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-04-26 00:22:39,126 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

2020-04-26 00:22:39,152 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)

INFO:sqlalchemy.engine.base.Engine:BEGIN (implicit)

2020-04-26 00:22:39,648 INFO sqlalchemy.engine.base.Engine INSERT INTO sqladb2 ("index", age, workclass, fnlwgt, education, education_num, marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

INFO:sqlalchemy.engine.base.Engine:INSERT INTO sqladb2 ("index", age, workclass, fnlwgt, education, education_num, marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

2020-04-26 00:22:39,650 INFO sqlalchemy.engine.base.Engine ((0, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K'), (1, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (2, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (3, 28, ' Private', 338409, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', 0, 0, 40, ' Cuba', ' <=50K'), (4, 37, ' Private', 284582, ' Masters', 14, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (5, 49, ' Private', 160187, ' 9th', 5, ' Married-spouse-absent', ' Other-service', ' Not-in-family', ' Black', ' Female', 0, 0, 16, ' Jamaica', ' <=50K'), (6, 52, ' Self-emp-not-inc', 209642, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 45, ' United-States', ' >50K'), (7, 31, ' Private', 45781, ' Masters', 14, ' Never-married', ' Prof-specialty', ' Not-in-family', ' White', ' Female', 14084, 0, 50, ' United-States', ' >50K')  ... displaying 10 of 32560 total bound parameter sets ...  (32558, 22, ' Private', 201490, ' HS-grad', 9, ' Never-married', ' Adm-clerical', ' Own-child', ' White', ' Male', 0, 0, 20, ' United-States', ' <=50K'), (32559, 52, ' Self-emp-inc', 287927, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 15024, 0, 40, ' United-States', ' >50K'))

INFO:sqlalchemy.engine.base.Engine:((0, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K'), (1, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (2, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (3, 28, ' Private', 338409, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', 0, 0, 40, ' Cuba', ' <=50K'), (4, 37, ' Private', 284582, ' Masters', 14, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (5, 49, ' Private', 160187, ' 9th', 5, ' Married-spouse-absent', ' Other-service', ' Not-in-family', ' Black', ' Female', 0, 0, 16, ' Jamaica', ' <=50K'), (6, 52, ' Self-emp-not-inc', 209642, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 45, ' United-States', ' >50K'), (7, 31, ' Private', 45781, ' Masters', 14, ' Never-married', ' Prof-specialty', ' Not-in-family', ' White', ' Female', 14084, 0, 50, ' United-States', ' >50K')  ... displaying 10 of 32560 total bound parameter sets ...  (32558, 22, ' Private', 201490, ' HS-grad', 9, ' Never-married', ' Adm-clerical', ' Own-child', ' White', ' Male', 0, 0, 20, ' United-States', ' <=50K'), (32559, 52, ' Self-emp-inc', 287927, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 15024, 0, 40, ' United-States', ' >50K'))

2020-04-26 00:22:39,778 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

In [ ]:
# Making some basic queries

In [163]:
"""Select all from dataframe"""

cur.execute("""Select * from sqladb2 ;""")
new = pd.DataFrame(cur.fetchall())
new.columns = [x[0] for x in cur.description]
new.head()

,index,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,4,37,Private,284582,MBA,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [ ]:
# Here i am trying to see the unique values of each column for easy slicing

In [164]:
new.education.unique()

array([' Bachelors', ' HS-grad', ' 11th', ' MBA', ' 9th', ' Some-college',
       ' Assoc-acdm', ' Assoc-voc', ' 7th-8th', ' Doctorate',
       ' Prof-school', ' 5th-6th', ' 10th', ' 1st-4th', ' Preschool',
       ' 12th'], dtype=object)

In [154]:
new.marital_status.unique()

array([' Married-civ-spouse', ' Divorced', ' Married-spouse-absent',
       ' Never-married', ' Separated', ' Married-AF-spouse', ' Widowed'],
      dtype=object)

In [156]:
new.native_country.unique()

array([' United-States', ' Cuba', ' Jamaica', ' India', ' ?', ' Mexico',
       ' South', ' Puerto-Rico', ' Honduras', ' England', ' Canada',
       ' Germany', ' Iran', ' Philippines', ' Italy', ' Poland',
       ' Columbia', ' Cambodia', ' Thailand', ' Ecuador', ' Laos',
       ' Taiwan', ' Haiti', ' Portugal', ' Dominican-Republic',
       ' El-Salvador', ' France', ' Guatemala', ' China', ' Japan',
       ' Yugoslavia', ' Peru', ' Outlying-US(Guam-USVI-etc)', ' Scotland',
       ' Trinadad&Tobago', ' Greece', ' Nicaragua', ' Vietnam', ' Hong',
       ' Ireland', ' Hungary', ' Holand-Netherlands'], dtype=object)

In [ ]:
# Basic Query 1

In [165]:
cur.execute("""Select * 
               From sqladb2 
               Where marital_status == ' Divorced'  ;""")
new2 = pd.DataFrame(cur.fetchall())
new2.columns = [x[0] for x in cur.description]
new2.head()

,index,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
1,18,43,Self-emp-not-inc,292175,MBA,14,Divorced,Exec-managerial,Unmarried,White,Female,0,0,45,United-States,>50K
2,23,59,Private,109015,HS-grad,9,Divorced,Tech-support,Unmarried,White,Female,0,0,40,United-States,<=50K
3,27,39,Private,367260,HS-grad,9,Divorced,Exec-managerial,Not-in-family,White,Male,0,0,80,United-States,<=50K
4,31,45,Private,386940,Bachelors,13,Divorced,Exec-managerial,Own-child,White,Male,0,1408,40,United-States,<=50K

In [ ]:
# Basic Query 2

# 1 <a id='7'>Write two basic update queries<a/>

In [ ]:
# Here i updated the Master in the education column to MBA

In [159]:
cur.execute("""Update sqladb2 Set education = ' MBA' Where education = ' Masters' ;""")
print(pd.read_sql_query("SELECT * FROM sqladb2", con).head(5))

   index  age          workclass  fnlwgt   education  education_num  \
0      0   50   Self-emp-not-inc   83311   Bachelors             13
1      1   38            Private  215646     HS-grad              9
2      2   53            Private  234721        11th              7
3      3   28            Private  338409   Bachelors             13
4      4   37            Private  284582         MBA             14

        marital_status          occupation    relationship    race      sex  \
0   Married-civ-spouse     Exec-managerial         Husband   White     Male
1             Divorced   Handlers-cleaners   Not-in-family   White     Male
2   Married-civ-spouse   Handlers-cleaners         Husband   Black     Male
3   Married-civ-spouse      Prof-specialty            Wife   Black   Female
4   Married-civ-spouse     Exec-managerial            Wife   White   Female

   capital_gain  capital_loss  hours_per_week  native_country  income
0             0             0              13   United-States   <=50K
1             0             0              40   United-States   <=50K
2             0             0              40   United-States   <=50K
3             0             0              40            Cuba   <=50K
4             0             0              40   United-States   <=50K

# Check results After Updating Masters to MBA

In [166]:
cur.execute("""Select * from sqladb2 where education = ' MBA' AND native_country = ' United-States'
                ;""")
new3 = pd.DataFrame(cur.fetchall())
new3.columns = [x[0] for x in cur.description]
new3.head()

,index,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,4,37,Private,284582,MBA,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
1,7,31,Private,45781,MBA,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
2,18,43,Self-emp-not-inc,292175,MBA,14,Divorced,Exec-managerial,Unmarried,White,Female,0,0,45,United-States,>50K
3,46,44,Private,128354,MBA,14,Divorced,Exec-managerial,Unmarried,White,Female,0,0,40,United-States,<=50K
4,86,33,Private,202051,MBA,14,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,50,United-States,<=50K

In [168]:
cur.execute('UPDATE sqladb2 SET marital_status = "Married" WHERE marital_status = " Married-civ-spouse"')
print(pd.read_sql_query("SELECT * FROM sqladb2", con).tail(5))

       index  age      workclass  fnlwgt    education  education_num  \
32555  32555   27        Private  257302   Assoc-acdm             12
32556  32556   40        Private  154374      HS-grad              9
32557  32557   58        Private  151910      HS-grad              9
32558  32558   22        Private  201490      HS-grad              9
32559  32559   52   Self-emp-inc  287927      HS-grad              9

       marital_status          occupation relationship    race      sex  \
32555         Married        Tech-support         Wife   White   Female
32556         Married   Machine-op-inspct      Husband   White     Male
32557         Widowed        Adm-clerical    Unmarried   White   Female
32558   Never-married        Adm-clerical    Own-child   White     Male
32559         Married     Exec-managerial         Wife   White   Female

       capital_gain  capital_loss  hours_per_week  native_country  income
32555             0             0              38   United-States   <=50K
32556             0             0              40   United-States    >50K
32557             0             0              40   United-States   <=50K
32558             0             0              20   United-States   <=50K
32559         15024             0              40   United-States    >50K

# Check results

In [173]:
cur.execute("""Select * from sqladb2 where marital_status = 'Married' ;""")
new4 = pd.DataFrame(cur.fetchall())
new4.columns =  [x[0] for x in cur.description]
new4.head()

,index,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,0,50,Self-emp-not-inc,83311,Bachelors,13,Married,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,2,53,Private,234721,11th,7,Married,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
2,3,28,Private,338409,Bachelors,13,Married,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
3,4,37,Private,284582,MBA,14,Married,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
4,6,52,Self-emp-not-inc,209642,HS-grad,9,Married,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K

# 2 <a id='7'>Write two delete queries<a/>


# 3 <a id='7'>Write two filter queries<a/>

# 4 <a id='7'>Write two function queries<a/>

# <a id='7'>Done<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>

In [ ]:
# <a id='7'>Rename the columns<a/>